In [1]:
import pandas as pd

In [2]:
df = pd.read_excel('ventas_tienda.xlsx')

In [3]:
df.head(10)

    Producto Codigo  Precio
0     Laptop   A001     200
1      Mause   A002      20
2    Teclado   A003      10
3    Monitor   A004      40
4     Camara   A005      15
5      Silla   A006      10
6       Mesa   A007      25
7    Lampara   A008      30
8   Cornetas   A009      35
9  Audifonos   A010      12

In [4]:
df.info()
df.describe()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 11 entries, 0 to 10
Data columns (total 3 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Producto  11 non-null     object
 1   Codigo    11 non-null     object
 2   Precio    11 non-null     int64
dtypes: int64(1), object(2)
memory usage: 392.0+ bytes

           Precio
count   11.000000
mean    37.727273
std     54.759640
min     10.000000
25%     13.500000
50%     20.000000
75%     32.500000
max    200.000000